## Data

In [1]:
import pandas as pd

In [2]:
students = {
    'name': ['Finley', 'Andrew', 'Blake', "Denis"],
    'last_name': ['Brown', 'Bradley', 'Hughes', "James"],
    'age': [23, 21, 34,24],
    "student_number":[101, 403, 202,1]
    

}

In [3]:
student_df = pd.DataFrame(students)

In [4]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [6]:
student_df.loc[2]

name               Blake
last_name         Hughes
age                   34
student_number       202
Name: 2, dtype: object

In [7]:
student_df.iloc[2]

name               Blake
last_name         Hughes
age                   34
student_number       202
Name: 2, dtype: object

In [7]:
student_df.iloc[0:2]

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403

In [8]:
student_df.loc[0:2]

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202

## Satırların Değerlerini Güncellemek

### List ile Güncellemek

In [9]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake    Hughes   34             202
3   Denis     James   24               1

In [10]:
student_df.loc[2]

name               Blake
last_name         Hughes
age                   34
student_number       202
Name: 2, dtype: object

In [11]:
student_df.loc[2] = ["Charlie", "Brown", 8, 202]

In [12]:
student_df

      name last_name  age  student_number
0   Finley     Brown   23             101
1   Andrew   Bradley   21             403
2  Charlie     Brown    8             202
3    Denis     James   24               1

* Kaç tane sütun varsa o kadar değer vermem gerekir

In [13]:
student_df.loc[2] = ["Charlie", "Brown", 8]

ValueError: Must have equal len keys and value when setting with an iterable

In [14]:
student_df

      name last_name  age  student_number
0   Finley     Brown   23             101
1   Andrew   Bradley   21             403
2  Charlie     Brown    8             202
3    Denis     James   24               1

### Spesifik Bir Değeri Güncellemek

In [9]:
student_df

      name last_name  age  student_number
0   Finley     Brown   23             101
1   Andrew   Bradley   21             403
2  Charlie     Brown    8             302
3    Denis     James   24               1

In [10]:
student_df.loc[2, "name"]

'Charlie'

In [11]:
student_df.loc[2, "name"] = "Dave"

In [12]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2    Dave     Brown    8             302
3   Denis     James   24               1

* Aynı şekilde iloc ile de yapabiliriz

In [13]:
student_df.iloc[2, 0] = "Blake"

In [14]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake     Brown    8             302
3   Denis     James   24               1

#### at & iat

* `at` ve `iat`,  `loc` ve `iloc` gibi, sadece scalar değerler üzerinde işlem yapabiliyorlar, array işlemleri için uygun değil ama daha hızlı erişim sağlıyorlar

In [7]:
student_df.at[2, "name"]

'Blake'

In [15]:
student_df.at[2, "name"] = "Charlie"

In [16]:
student_df

      name last_name  age  student_number
0   Finley     Brown   23             101
1   Andrew   Bradley   21             403
2  Charlie     Brown    8             302
3    Denis     James   24               1

In [17]:
student_df.iat[2, 0] = "Blake"

In [18]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake     Brown    8             302
3   Denis     James   24               1

### Birden Çok Satırı Aynı Anda Değiştirmek

In [19]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake     Brown    8             302
3   Denis     James   24               1

In [15]:
student_df["name"]

0     Finley
1     Andrew
2    Charlie
3      Denis
Name: name, dtype: object

In [16]:
str.lower("Finley")

'finley'

In [4]:
"Finley".lower()

'finley'

In [17]:
student_df["name"].str.lower()

0     finley
1     andrew
2    charlie
3      denis
Name: name, dtype: object

In [22]:
student_df

     name last_name  age  student_number
0  Finley     Brown   23             101
1  Andrew   Bradley   21             403
2   Blake     Brown    8             302
3   Denis     James   24               1

In [23]:
student_df["name"] = student_df["name"].str.lower()

In [24]:
student_df

     name last_name  age  student_number
0  finley     Brown   23             101
1  andrew   Bradley   21             403
2   blake     Brown    8             302
3   denis     James   24               1

### General Error

In [25]:
student_df

     name last_name  age  student_number
0  finley     Brown   23             101
1  andrew   Bradley   21             403
2   blake     Brown    8             302
3   denis     James   24               1

In [26]:
student_df["age"]

0    23
1    21
2     8
3    24
Name: age, dtype: int64

In [27]:
filt = (student_df["age"] < 22)

In [28]:
filt

0    False
1     True
2     True
3    False
Name: age, dtype: bool

In [29]:
student_df[filt]

     name last_name  age  student_number
1  andrew   Bradley   21             403
2   blake     Brown    8             302

In [30]:
student_df[filt]["last_name"]

1    Bradley
2      Brown
Name: last_name, dtype: object

In [31]:
student_df[filt]["last_name"] = ["Allen", "Finley"]

c:\users\engin\appdata\local\programs\python\python37\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [32]:
# It did not work
student_df

     name last_name  age  student_number
0  finley     Brown   23             101
1  andrew   Bradley   21             403
2   blake     Brown    8             302
3   denis     James   24               1

In [35]:
student_df.loc[filt, "last_name"] = ["Allen", "Finley"]

In [36]:
student_df

     name last_name  age  student_number
0  finley     Brown   23             101
1  andrew     Allen   21             403
2   blake    Finley    8             302
3   denis     James   24               1